core/app/controllers/components_controller.rb

  def index
    @components = Component.all
---
SELECT "components".* FROM "components"