core/app/controllers/editors_controller.rb

SELECT "editors".* FROM "editors"
---
  def index
    @editors = Editor.all

INSERT INTO "editors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "IBM"], ["created_at", "2022-09-11 00:00:11.523326"], ["updated_at", "2022-09-11 00:00:11.523326"]]
---
  def create
    @editor = Editor.new(editor_params)

    respond_to do |format|
      if @editor.save

SELECT "editors".* FROM "editors" WHERE "editors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_editor
      @editor = Editor.find(params[:id])